#+STARTUP: content showstars indent
#+OPTIONS: tags:nil
#+TITLE: Hedera TicTacToe REST Client
#+FILETAGS: hedera tic_tac_toe restclient


* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var hosts=hosts devices=devices commands=commands :results output drawer
    (defun output-table-constants (table var-name)
      "Does the thing"
      (while table
        (progn (setq row (car table))
               (if (string= "x" (nth 1 row))
                 (princ (format "#+CONSTANTS: %s=%s\n" var-name (nth 2 row))) nil)
               (setq table (cdr table)))))

    (output-table-constants hosts "host")
    (output-table-constants devices "device")
    (output-table-constants commands "command")
  #+END_SRC

  #+RESULTS[7c6c116a8b595159a96b2b30bde8f4fc9db20ad2]: define-constants-with-src-block
  :results:
  #+CONSTANTS: host=http://localhost:3000
  #+CONSTANTS: device=1040
  #+CONSTANTS: command=off
  :end:

